<template>
    <div v-if="categories.length > 0"
        class="w-full p-5 mb-3 bg-white border border-gray-200 rounded-lg dark:bg-gray-800 dark:border-gray-700">
        <!-- 分类标题 -->
        <svg t="1707321156673" class="icon inline mr-1 w-6 h-6" viewBox="0 0 1024 1024" version="1.1"
            xmlns="http://www.w3.org/2000/svg" p-id="11435" width="200" height="200">
            <path
                d="M360.789333 235.178667h302.421334c12.458667 0 23.637333 7.594667 28.074666 19.2l67.84 175.104c7.594667 19.712-6.912 40.96-28.074666 40.96H292.949333c-21.162667 0-35.754667-21.248-28.074666-40.96l67.84-175.104a30.062933 30.062933 0 0 1 28.074666-19.2z"
                fill="#64EDAC" p-id="11436"></path>
            <path
                d="M907.264 537.173333v-0.341333c0-0.768-0.170667-1.450667-0.256-2.048-0.085333-1.450667-0.170667-2.816-0.426667-4.352-0.256-1.450667-0.768-2.816-1.28-4.266667-0.256-0.682667-0.341333-1.365333-0.597333-1.877333l-0.170667-0.256c0-0.085333 0-0.085333-0.085333-0.170667l-145.237333-356.693333a33.006933 33.006933 0 0 0-30.634667-20.650667H606.976c-18.346667 0-33.194667 14.848-33.194667 33.194667s14.848 33.194667 33.194667 33.194667h99.242667l118.442666 290.816H637.610667c-18.346667 0-33.194667 14.848-33.194667 33.194666 0 34.389333-42.325333 63.488-92.416 63.488s-92.416-29.098667-92.416-63.488c0-18.346667-14.848-33.194667-33.194667-33.194666H199.253333l118.442667-290.816h99.242667c18.346667 0 33.194667-14.848 33.194666-33.194667s-14.848-33.194667-33.194666-33.194667H295.424c-13.482667 0-25.6 8.106667-30.634667 20.650667L119.466667 523.861333c0 0.085333 0 0.085333-0.085334 0.170667l-0.170666 0.341333c-0.256 0.682667-0.341333 1.365333-0.597334 1.962667-0.512 1.450667-0.938667 2.730667-1.28 4.266667-0.256 1.450667-0.341333 2.816-0.426666 4.266666 0 0.682667-0.170667 1.365333-0.170667 2.048V844.288c0 18.346667 14.848 33.194667 33.194667 33.194667h724.138666c18.346667 0 33.194667-14.848 33.194667-33.194667V537.344v-0.170667z m-66.389333 273.92H183.125333V570.026667h175.36c18.005333 55.552 80.042667 96.682667 153.514667 96.682666s135.594667-41.130667 153.514667-96.682666h175.36v241.066666z"
                fill="#333C4F" p-id="11437"></path>
            <path
                d="M656.810667 479.829333H367.189333c-18.346667 0-33.194667-14.848-33.194666-33.194666s14.848-33.194667 33.194666-33.194667h289.621334c18.346667 0 33.194667 14.848 33.194666 33.194667s-14.848 33.194667-33.194666 33.194666zM595.2 380.16h-166.4c-18.346667 0-33.194667-14.848-33.194667-33.194667s14.848-33.194667 33.194667-33.194666h166.314667c18.346667 0 33.194667 14.848 33.194666 33.194666s-14.848 33.194667-33.109333 33.194667zM538.709333 280.490667h-53.418666c-18.346667 0-33.194667-14.848-33.194667-33.194667s14.848-33.194667 33.194667-33.194667h53.418666c18.346667 0 33.194667 14.848 33.194667 33.194667s-14.848 33.194667-33.194667 33.194667z"
                fill="#333C4F" p-id="11438"></path>
        </svg>
        <span class="mb-2 font-bold text-gray-900 uppercase dark:text-white">分类</span>
        <!-- 分类列表 -->
        <div
            class="text-sm font-medium text-gray-600 bg-white rounded-lg dark:bg-gray-700 dark:border-gray-600 dark:text-white">
            <a @click="goCategoryArticleListPage(category.id, category.name)" v-for="(category, index) in categories"
                :key="index"
                class="flex items-center w-full px-4 py-2 rounded-lg border-gray-200 cursor-pointer hover:bg-gray-100 hover:text-blue-700 dark:border-gray-600 dark:hover:bg-gray-600 dark:hover:text-white dark:focus:ring-gray-500 dark:focus:text-white">
                <svg class="w-3.5 h-3.5 mr-1.5 dark:text-white" aria-hidden="true" xmlns="http://www.w3.org/2000/svg"
                    fill="none" viewBox="0 0 21 18">
                    <path stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2"
                        d="M2.539 17h12.476l4-9H5m-2.461 9a1 1 0 0 1-.914-1.406L5 8m-2.461 9H2a1 1 0 0 1-1-1V2a1 1 0 0 1 1-1h5.443a1 1 0 0 1 .8.4l2.7 3.6H16a1 1 0 0 1 1 1v2H5" />
                </svg>
                {{ category.name }}
            </a>
        </div>
    </div>
</template>

<script setup>
import { getCategoryList } from '@/api/frontend/category'
import { ref } from 'vue'
import { useRouter } from 'vue-router'

// 引入路由
const router = useRouter()

// 跳转分类文章列表页
const goCategoryArticleListPage = (id, name) => {
    // 跳转时通过 query 携带参数（分类 ID、分类名称）
    router.push({ path: '/category/article/list', query: { id, name } })
}

// 所有分类
const categories = ref([])
getCategoryList().then((res) => {
    if (res.success) {
        categories.value = res.data
    }
})
</script>
